000100*****************************************************************
000200* DATA     :  30/10/2023
000300* AUTOR    : VAGNER RENATO BELLACOSA
000400* OBJETIVO : PROGRAMA EXEMPLO VSAM KSDS
000500*            PRIMEIRO ACESSO ARQUIVO VAZIO
000600* CPD      : INEFE
000700*****************************************************************
000800
000900*************************
001000*PRIMEIRA DIVSAO*********
001100*************************
001200 IDENTIFICATION DIVISION.
001300*************************
001400 PROGRAM-ID. CBVSAM06.
001500 AUTHOR. VAGNER BELLACOSA.
001600 DATE-WRITTEN. 30/10/23 @ 20:48:00.
001700 DATE-COMPILED. 2023-10-30.
001740 INSTALLATION. INEFE.
001750 SECURITY. NORMAL.
001800
001900**********************
002200 ENVIRONMENT DIVISION.
002300**********************
002400 INPUT-OUTPUT SECTION.
002500*
002600 FILE-CONTROL.
002700     SELECT EMPFILE ASSIGN TO EMPFILE
002800     ORGANIZATION IS INDEXED
002900     ACCESS MODE  IS DYNAMIC
003000     RECORD KEY   IS EMP-ID
003100     FILE STATUS  IS FILE-STATUS VSAM-CODE.
003200*
003400***************
003600 DATA DIVISION.
003700***************
003800*
003900 FILE SECTION.
004000*
004100 FD EMPFILE
004200     RECORD CONTAINS 80  CHARACTERS
004300     BLOCK  CONTAINS 800 CHARACTERS
004400     DATA RECORD     IS EMPFILE-RECORD.
004500*
004600 01 EMPFILE-RECORD.
004700   05 EMP-ID          PIC X(11).
004800   05 FILLER          PIC X(01).
004900   05 EMP-ORDEM       PIC 99.
004910   05 FILLER          PIC X(01).
005000   05 EMP-NAME        PIC X(22).
005200   05 EMP-TESTE       PIC 9(06).
005300   05 EMP-SEPARADOR   PIC X(01).
005400   05 EMP-FLAG        PIC 9.
005500   05 EMP-LOGRADOURO  PIC X(16).
005600   05 EMP-CIDADE      PIC X(08).
005700   05 EMP-UF          PIC XX.
005800   05 EMP-CEP         PIC X(09).
005900*
006000 WORKING-STORAGE SECTION.
006100*
006200 01 WSS-VAR.
006300    05 FILE-STATUS             PIC 9(02).
006400    05 WSS-EOF-SW              PIC X(01).
006500       88 WSS-EOF                VALUE 'S'.
006600       88 WS-NOT-EOF             VALUE 'N'.
006700    05 VSAM-CODE.
006800       10 VSAM-RETURN-CODE     PIC S9(2) USAGE BINARY.
006900       10 VSAM-COMPONENT-CODE  PIC S9(1) USAGE BINARY.
007000       10 VSAM-REASON-CODE     PIC S9(3) USAGE BINARY.
007100*
007200 77  WSS-MESSAGE               PIC X(99).
007300 77  WSS-REG-GRAVADOS          PIC 9(10).
007400 77  WSS-DATA-COMPIL           PIC X(16).
007500*
007600*********************
007700*QUARTA DIVSAO ******
007800*********************
007900 PROCEDURE DIVISION.
008000********************
008100
008200     DISPLAY 'CBVSAM06'.
008300     DISPLAY 'GRAVACAO VSAM VAZIO'.
008400
008500     MOVE  FUNCTION WHEN-COMPILED  TO WSS-DATA-COMPIL.
008600
008700     DISPLAY ' WSS-DATA-COMPIL = ' WSS-DATA-COMPIL.
008800     DISPLAY ' '.
008900
009000     PERFORM ROT-OPEN-FILE
009100        THRU ROT-OPEN-FILE-EXIT.
009200
009300     PERFORM ROT-WRITE-FILE
009400        THRU ROT-WRITE-FILE-EXIT.
009500
009600     PERFORM ROT-CLOSE-FILE
009700        THRU ROT-CLOSE-FILE-EXIT.
009800
009900     PERFORM ROT-ESTATISTIC
010000        THRU ROT-ESTATISTIC-EXIT.
010100
010200     STOP RUN.
010300
010400****************************************************************
010500* SECAO TRATA ARQUIVOS *****************************************
010600****************************************************************
010700 ROT-OPEN-FILE.
010800
010900     DISPLAY 'ROT-OPEN-FILE'.
011000
011100*    OPEN INPUT EMPFILE.
011200     OPEN OUTPUT EMPFILE.
011300
011400     IF FILE-STATUS > 0
011500        MOVE 'ERRO NA ABERTURA DO ARQUIVO EMPFILE '
011600             TO WSS-MESSAGE
011700        MOVE FILE-STATUS  TO  RETURN-CODE
011800        PERFORM ROT-ABEND
011900     END-IF.
011910
012000 ROT-OPEN-FILE-EXIT.
012100     EXIT.
012200
012300 ROT-WRITE-FILE.
012400
012500     DISPLAY 'ROT-WRITE-FILE'.
012600
012700     ADD 01 TO WSS-REG-GRAVADOS.
012800
012900     WRITE EMPFILE-RECORD
013000               INVALID KEY MOVE 'REGISTRO NAO GRAVADO'
013100                           TO WSS-MESSAGE
013200                           PERFORM ROT-ABEND
013300           NOT INVALID KEY MOVE 'REGISTRO GRAVADO'
013400                           TO WSS-MESSAGE
013500                           PERFORM ROT-ABEND
013600     END-WRITE.
013610
013700 ROT-WRITE-FILE-EXIT.
013800      EXIT.
013900
014000 ROT-CLOSE-FILE.
014100
014200     DISPLAY 'ROT-CLOSE-FILE'.
014300
014400     CLOSE EMPFILE.
014500
014600     IF FILE-STATUS > 0
014700       MOVE 'ERRO NO FECHAMENTO DO ARQUIVO EMPFILE '
014800                         TO WSS-MESSAGE
014900       MOVE FILE-STATUS  TO  RETURN-CODE
015000       PERFORM ROT-ABEND
015100     END-IF.
015110
015200 ROT-CLOSE-FILE-EXIT.
015300     EXIT.
015400
015500 ROT-ESTATISTIC.
015600
015700     DISPLAY ' '.
015800     DISPLAY '*******************************************'.
015900     DISPLAY '*** PROGRAMA CBVSAM06                   ***'.
016000     DISPLAY '*******************************************'.
016100     DISPLAY '* TERMINO DE PROCESSAMENTO: OK            *'.
016200     DISPLAY '* REGISTRO GRAVADOS    : ' WSS-REG-GRAVADOS.
016300     DISPLAY '*******************************************'.
016400
016500 ROT-ESTATISTIC-EXIT.
016600     EXIT.
016610
016700 ROT-ABEND.
016800
016900     IF RETURN-CODE NOT EQUAL ZEROES
017000       DISPLAY ' '
017100       DISPLAY '*******************************************'
017200       DISPLAY ' ABEND PROGRAMADO '
017300       DISPLAY ' ERRO ENCONTRADO : '  RETURN-CODE
017400       DISPLAY ' WSS-MESSAGE     : '  WSS-MESSAGE
017500       DISPLAY ' FAVOR AVISAR O ANALISTA RESPONSAVEL'
017600       DISPLAY '*******************************************'
017610       STOP RUN
017700     ELSE
017800       DISPLAY ' WSS-MESSAGE     : '  WSS-MESSAGE
017900     END-IF.
018000
018100     PERFORM VSAM-CODE-DISPLAY.
018200
018400 ROT-ABEND-EXIT.
018500     EXIT.
018600
018700 VSAM-CODE-DISPLAY.
018800*
018900     DISPLAY "VSAM-CODE ==>"
019000             " RETURN: "  VSAM-RETURN-CODE,
019100             " COMPONENT: "  VSAM-COMPONENT-CODE,
019200             " REASON: "  VSAM-REASON-CODE.
019300
019400 VSAM-CODE-DISPLAY-EXIT.
019500     EXIT.
019600
019700 END PROGRAM CBVSAM06.
019800********************** FIM PROGRAMA   ****************************
