//EXECPGM1  JOB ('00'),TSO.&SYSUID,
//          REGION=0M,NOTIFY=&SYSUID,
//          MSGCLASS=T,MSGLEVEL=1,CLASS=A
//*------------------------------------------------------------------*
//* PROGRAMA COBOL009 RECEBE PARAMETROS VIA PARM
//*------------------------------------------------------------------*
//JOBLIB  DD DSN=IBMUSER.CBL.LOADLIB,DISP=SHR
//*------------------------------------------------------------------*
//*------------------------------------------------------------------*
//* EXEMPLOS DE NUMERICO COMPUTACIONAL
//*------------------------------------------------------------------*
//EXEC001  EXEC PGM=COBOL015,PARM='005'
//*STEPLIB DD DSN=IBMUSER.WORKBOOK.COBOL,DISP=SHR
//SYSOUT   DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
MARGARIDA
ANTONIO CARLOS NASCIMENTO VULGO MUSSUM
XXX
/*
//*------------------------* FIM DO JCL     *------------------------*
