//CATEXAM   JOB ('00'),TSO.&SYSUID,                                     JOB00050
//          REGION=0M,NOTIFY=&SYSUID,
//          MSGCLASS=T,MSGLEVEL=1,CLASS=A
//*------------------------------------------------------------------*
//*------------------------------------------------------------------*
//*------------------------------------------------------------------*
//*---- EXAMINA O ARQUIVO VSAM VIA IDCAMS          ------------------*
//*------------------------------------------------------------------*
//*------------------------------------------------------------------*
//STEP1  EXEC PGM=IDCAMS
//SYSPRINT DD  SYSOUT=*
//SYSIN    DD  *
   EXAMINE NAME(IBMUSER.VSAM.DATASET.KSDS)
      INDEXTEST DATATEST -
      ERRORLIMIT(50)
//*------------------------* FIM DO JCL     *------------------------*
