//CATLIST   JOB ('00'),TSO.&SYSUID,                                     JOB00050
//          REGION=0M,NOTIFY=&SYSUID,
//          MSGCLASS=T,MSGLEVEL=1,CLASS=A
//*------------------------------------------------------------------*
//*------------------------------------------------------------------*
//*------------------------------------------------------------------*
//*---- LISTA CATALOGO  VIA IDCAMS                 ------------------*
//*------------------------------------------------------------------*
//STEP1  EXEC PGM=IDCAMS
//SYSPRINT DD  SYSOUT=*
//SYSIN    DD  *
   LISTCAT ENTRY(IBMUSER.VSAM.KSDS) ALL
//*------------------------* FIM DO JCL     *------------------------*
